src/cf/DataProcessors/ивс_СоздатьТЛистыДляОбновленияБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ивс_СоздатьТЛистыДляОбновленияБаз</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/Статус.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Статус</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненоОжидаетПриемки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/Срочность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Срочность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Критичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средняя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/БазаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>БазаДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Заказчики</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКБазе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СКакогоСервераПодключаться</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РелизКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РелизКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обновляется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоработкиВОсновнойКонфигурации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоработкиВРасширенияхКонфигурации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/ивс_СоздатьТЛистыДляОбновленияБаз/Ext/ObjectModule.bsl
Процедура ЗаполнитьИСформироватьТЛисты(ДатаМесяц) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаМесяц) Тогда
		ДатаМесяц = ТекущаяДата();
	КонецЕсли;
	
	КатегорияОбновления = Справочники.Категории.НайтиПоНаименованию("Обновление релизов");
	ПостановщикОбновления = Справочники.Пользователи.НайтиПоНаименованию("Дорин Дмитрий");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БД.Владелец КАК Заказчик,
	                      |	БД.Ссылка КАК БазаДанных,
	                      |	ЗаданиеОбновленныеБазы.Ссылка КАК ДокументОбновления
	                      |ИЗ
	                      |	Справочник.БазаДанных КАК БД
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Задание.ОбновленныеБазы КАК ЗаданиеОбновленныеБазы
	                      |		ПО БД.Ссылка = ЗаданиеОбновленныеБазы.БазаДанных
	                      |			И (НАЧАЛОПЕРИОДА(&ДатаОбновления, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ЗаданиеОбновленныеБазы.Ссылка.Дата, МЕСЯЦ))
	                      |			И БД.Владелец = ЗаданиеОбновленныеБазы.Ссылка.Заказчик
	                      |ГДЕ
	                      |	БД.Обновляется
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗаданиеОбновленныеБазы.Ссылка,
	                      |	БД.Ссылка,
	                      |	БД.Владелец");
	
	Запрос.УстановитьПараметр("ДатаОбновления", ДатаМесяц);
	ТаблицаОбновления = Запрос.Выполнить().Выгрузить();
	ТаблицаЗаказчиков = ТаблицаОбновления.Скопировать();
	ТаблицаЗаказчиков.Свернуть("Заказчик");
	
	Для Каждого Стр Из ТаблицаЗаказчиков Цикл
		СтрПоиска = ТаблицаОбновления.НайтиСтроки(Новый Структура("Заказчик", Стр.Заказчик));
		
		ДокументОбъект = Неопределено;
		
		Для Каждого СтрОбновления Из СтрПоиска Цикл
			Если ЗначениеЗаполнено(СтрОбновления.БазаДанных.Ответственный) Тогда
				ОтветственныйОбновление = СтрОбновления.БазаДанных.Ответственный;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрОбновления.БазаДанных.Конфигурация) Тогда
				КонфигурацияОбновление = СтрОбновления.БазаДанных.Конфигурация;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрОбновления.ДокументОбновления) Тогда
				ДокументОбъект = СтрОбновления.ДокументОбновления.ПолучитьОбъект();
			КонецЕсли;
		КонецЦикла;
		Если ДокументОбъект = Неопределено Тогда
			ДокументОбъект = Документы.Задание.СоздатьДокумент();
		Иначе
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект.Дата = ТекущаяДата(); 
		ДокументОбъект.Тема = "Обновление баз за период: " + Формат(ДатаМесяц, "ДФ='ММММ гггг'") + ". Клиент: " + Стр.Заказчик.Наименование;
		ДокументОбъект.ТекстЗадания = ДокументОбъект.Тема;
		ДокументОбъект.Проект = Стр.Заказчик.ПроектДляОбновления;
		ДокументОбъект.Заказчик = Стр.Заказчик;
		ДокументОбъект.Категория = КатегорияОбновления;
		ДокументОбъект.Постановщик = ПостановщикОбновления;
		ДокументОбъект.ОтветственныйИсполнитель = ОтветственныйОбновление;
		ДокументОбъект.Статус = Перечисления.Статус.Новое;
		ДокументОбъект.Срочность = Перечисления.Срочность.Средняя;	
		ДокументОбъект.Конфигурация = КонфигурацияОбновление;
		ДокументОбъект.Комментарий = "Т-лист создан обработкой генирации: " + Формат(ТекущаяДата(), "ДЛФ=DDT")+ ". Обновление требуется произвести после 20го числа";
		ДокументОбъект.Обновление = Истина;
		ДокументОбъект.НачалоПлан = ДокументОбъект.Дата ;
		ДокументОбъект.ОкончаниеПлан = КонецМесяца(ДокументОбъект.Дата);
		//ДокументОбъект.ПлановыеТрудозатраты = 1;
		
		ДокументОбъект.ОбновленныеБазы.Очистить();
		Для Каждого СтрОбновления Из СтрПоиска Цикл
			Н_стр = ДокументОбъект.ОбновленныеБазы.Добавить();
			Н_стр.БазаДанных = СтрОбновления.БазаДанных;
			Н_стр.Конфигурация = СтрОбновления.БазаДанных.Конфигурация;
		КонецЦикла;
		
		ДокументОбъект.СписокИсполнителей.Очистить();
		Для Каждого СтрОбновления Из СтрПоиска Цикл
			Если ЗначениеЗаполнено(СтрОбновления.БазаДанных.Ответственный) Тогда
				Н_Стр = ДокументОбъект.СписокИсполнителей.Добавить();
				Н_стр.Исполнитель = СтрОбновления.БазаДанных.Ответственный;
			КонецЕсли;
		КонецЦикла;
		
		ДокументОбъект.Записать();
	КонецЦикла;
	
	
КонецПроцедуры
